import React from "react"

import { FaStarAndCrescent } from "react-icons/fa"

import Card from "@components/Card"

const Rewards = () => {
  return (
    <Card title="دليل مشروعية النكاح">
      <div className="font-amiri my-7 text-xl xl:px-7 xl:text-3xl">
        وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا
        لِتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً ۚ إِنَّ
        فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ
      </div>
      <div className="xl:px-7">
        وَمِنْ آيَاتِهِ: الدالة على رحمته وعنايته بعباده وحكمته العظيمة وعلمه
        المحيط، أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا: تناسبكم
        وتناسبونهن وتشاكلكم وتشاكلونهن، لِتَسْكُنُوا إِلَيْهَا وَجَعَلَ
        بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً: بما رتب على الزواج من الأسباب الجالبة
        للمودة والرحمة. فحصل بالزوجة الاستمتاع واللذة والمنفعة بوجود الأولاد
        وتربيتهم، والسكون إليها، فلا تجد بين أحد في الغالب مثل ما بين الزوجين من
        المودة والرحمة، إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ:
        يُعملون أفكارهم ويتدبرون آيات اللّه وينتقلون من شيء إلى شيء. (تفسير
        السعدي)
      </div>
      <div>سورة الرُّوم، الآية 21</div>
      <label
        htmlFor="modal-dalil"
        className="modal-button btn btn-outline my-3"
      >
        <FaStarAndCrescent size={20} className="mr-2" />
        للمزيد من الأدلة
      </label>
    </Card>
  )
}

export default Rewards
