import React from "react"

import { FaStarAndCrescent } from "react-icons/fa"

import Card from "@components/Card"

const Rewards = () => {
  return (
    <Card title="دليل مشروعية النكاح">
      <div className="my-7 font-serif text-xl xl:px-7 xl:text-3xl">
        وَاَنْكِحُوا الْاَيَامٰى مِنْكُمْ وَالصّٰلِحِيْنَ مِنْ عِبَادِكُمْ
        وَاِمَاۤىِٕكُمْۗ اِنْ يَّكُوْنُوْا فُقَرَاۤءَ يُغْنِهِمُ اللّٰهُ مِنْ
        فَضْلِهٖۗ وَاللّٰهُ وَاسِعٌ عَلِيْمٌ
      </div>
      <div className="xl:px-7">
        "يأمر تعالى الأولياء والأسياد، بإنكاح من تحت ولايتهم من الأيامى وهم: من لا أزواج لهم، من رجال، ونساء ثيب، وأبكار، فيجب على القريب وولي اليتيم، أن يزوج من يحتاج للزواج، ممن تجب نفقته عليه، وإذا كانوا مأمورين بإنكاح من تحت أيديهم، كان أمرهم بالنكاح بأنفسهم من باب أولى. { وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ } يحتمل أن المراد بالصالحين، صلاح الدين، وأن الصالح من العبيد والإماء -وهو الذي لا يكون فاجرا زانيا- مأمور سيده بإنكاحه، جزاء له على صلاحه، وترغيبا له فيه، ولأن الفاسد بالزنا، منهي عن تزوجه، فيكون مؤيدا للمذكور في أول السورة، أن نكاح الزاني والزانية محرم حتى يتوب، ويكون التخصيص بالصلاح في العبيد والإماء دون الأحرار، لكثرة وجود ذلك في العبيد عادة، ويحتمل أن المراد بالصالحين الصالحون للتزوج المحتاجون إليه من العبيد والإماء، يؤيد هذا المعنى، أن السيد غير مأمور بتزويج مملوكه، قبل حاجته إلى الزواج. ولا يبعد إرادة المعنيين كليهما، والله أعلم. وقوله: { إِنْ يَكُونُوا فُقَرَاءَ } أي: الأزواج والمتزوجين { يُغْنِهِمُ اللَّهُ مِنْ فَضْلِهِ } فلا يمنعكم ما تتوهمون، من أنه إذا تزوج، افتقر بسبب كثرة العائلة ونحوه، وفيه حث على التزوج، ووعد للمتزوج بالغنى بعد الفقر. { وَاللَّهُ وَاسِعٌ } كثير الخير عظيم الفضل { عَلِيمٌ } بمن يستحق فضله الديني والدنيوي أو أحدهما، ممن لا يستحق، فيعطي كلا ما علمه واقتضاه حكمه."
      </div>
      <div>سورة النُّور، الأية 32</div>

      <label
        htmlFor="modal-dalil"
        className="modal-button btn btn-outline my-3"
      >
        <FaStarAndCrescent size={20} className="mr-2" />
        المزيد من الأدلة
      </label>
    </Card>
  )
}

export default Rewards
